import React from 'react'
import { Link } from 'gatsby'
import Layout from '../components/layout'

const Terms = () => (
  <Layout>
    <Link to="/">トップページへ</Link>
    <br /><br />

    <h1>参加規約</h1>
    <p>
      この参加規約（以下、本規約）は、DimensionP3（以下、当団体）が開催するイベントの参加条件を定めるものです。<br />
      参加者の皆さまには、本規約に従ってイベントにご参加していただきます。
    </p>

    <h2>第１条（適用）</h2>
    <ol>
      <li>本規約は、参加者と当団体との間のイベントの参加に関わる一切の関係に適用されるものとします。</li><br />
      <li>
        当団体は開催イベントに関し、本規約のほか、ご参加にあたってのルール等、各種の定め（以下、個別規定）をすることがあります。<br />
        これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。
      </li><br />
      <li>本規約の規定が個別規定の規定と矛盾する場合には、個別規定において特段の定めがない限り、個別規定の規定が優先されるものとします。</li>
    </ol>

    <h2>第２条（参加登録）</h2>
    <ol>
      <li>開催イベントにおいては、参加希望者が本規約に同意の上、当団体の定める方法によって参加登録を申請し、当団体がこれを承認することによって、参加登録が完了するものとします。</li><br />
      <li>当団体は、参加登録の申請者に以下の事由があると判断した場合、参加登録の申請を承認しないことがあり、その理由については一切の開示義務を負わないものとします。
        <ul>
          <li>参加登録の申請に際して虚偽の事項を届け出た場合</li>
          <li>本規約に違反したことがある者からの申請である場合</li>
          <li>その他、当団体が参加登録を相当でないと判断した場合</li>
        </ul>
      </li>
    </ol>

    <h2>第３条（参加費用および支払方法）</h2>
    <ol>
      <li>参加者は参加費用として、当団体が別途定め通知する参加費用を、当団体が指定する方法により支払うものとします。</li><br />
      <li>参加者が参加費用の支払を遅滞した場合には、当団体は参加費用支払遅滞者に対して、次回からの参加を拒否できるものとします。</li>
    </ol>

    <h2>第４条（禁止事項）</h2>
    <p>
      参加者は、イベントの参加にあたり、以下の行為をしてはなりません。
    </p>
    <ol>
      <li>法令または公序良俗に違反する行為</li>
      <li>犯罪行為に関連する行為</li>
      <li>イベントの内容等、開催イベントに含まれる著作権、商標権ほか知的財産権を侵害する行為</li>
      <li>当団体、ほかの参加者、またはその他第三者の正当な行為を妨害する行為</li>
      <li>イベントによって得られた情報を商業的に利用する行為</li>
      <li>当団体のイベントの運営を妨害するおそれのある行為</li>
      <li>不正アクセス、またはこれを試みる行為</li>
      <li>他の参加者に関する個人情報等を収集または蓄積する行為</li>
      <li>不正な目的を持ってイベントに参加する行為</li>
      <li>イベント参加者またはその他の第三者に不利益、損害、不快感を与える行為</li>
      <li>他の参加者に成りすます行為</li>
      <li>当団体が許諾しないイベント内での宣伝、広告、勧誘、または営業行為</li>
      <li>面識のない異性との出会いを目的とした行為</li>
      <li>当団体のイベントに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
      <li>その他、当団体が不適切と判断する行為</li>
    </ol>

    <h2>第５条（イベントおよびWebサイトの停止等）</h2>
    <ol>
      <li>
        当団体は、以下のいずれかの事由があると判断した場合、参加者に事前に通知することなくイベントおよび本Webサイトの全部または一部の提供を停止または中断することができるものとします。
        <ul>
          <li>当団体およびイベントにかかるシステムの保守点検または更新を行う場合</li>
          <li>地震、落雷、火災、停電または天災などの不可抗力により、イベントの開催・Webサイトの運営が困難となった場合</li>
          <li>コンピュータまたは通信回線等が事故により停止した場合</li>
          <li>その他、イベントの開催・本Webサイトの運営が困難と当団体が判断した場合</li>
        </ul>
      </li>
      <li>当団体は、イベントおよび本Webサイトの運営の停止または中断により、参加者または第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。</li>
    </ol>

    <h2>第６条（参加制限および登録抹消等）</h2>
    <ol>
      <li>
        当団体は、参加者が以下のいずれかに該当する場合には、事前の通知なく参加者に対してイベントの全部もしくは一部の参加を制限、または参加者としての登録を抹消することができるものとします。
        <ul>
          <li>本規約のいずれかの条項に違反した場合</li>
          <li>登録事項に虚偽の事実があることが判明した場合</li>
          <li>参加費用等の支払債務の不履行があった場合</li>
          <li>当団体からの連絡に対し、一定期間返答がない場合</li>
          <li>その他、当団体がイベントの参加を適当でないと判断した場合</li>
        </ul>
      </li>
      <li>当団体は、本条に基づき当団体が行った行為により参加者に生じた損害について、一切の責任を負いません。</li>
    </ol>

    <h2>第７条（退会）</h2>
    <p>参加者は、当団体の定める退会手続により、当団体から退会できるものとします。</p>

    <h2>第８条（保証の否認および免責事項）</h2>
    <ol>
      <li>
        当団体に関することは、事実上または法律上の瑕疵（かし）（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含む。）
        がないことを明示的にも黙示的にも保証しておりません。
      </li><br />
      <li>
        当団体は、イベントに起因して参加者に生じたあらゆる損害について一切の責任を負いません。<br />
        ただし、イベントに関する当団体と参加者との間の契約（本規約を含む。）が消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。
      </li><br />
      <li>
        前項ただし書きに定める場合であっても、当団体は、当団体の過失（重過失を除く。）による債務不履行または不法行為により参加者に生じた損害のうち特別な事情から生じた損害（当団体または参加者が損害発生につき予見、または予見し得た場合を含む。）について一切の責任を負いません。
        また、当団体の過失（重過失を除く。）による債務不履行または不法行為により参加者に生じた損害の賠償は、参加者から当該損害が発生したイベント開催時に受領した参加費用の額を上限とします。
      </li><br />
      <li>当団体は、イベントに関して、参加者と他の参加者または第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。</li>
    </ol>

    <h2>第９条（イベント内容の変更等）</h2>
    <p>当団体は、参加者に通知することなく、イベントの内容を変更またはイベントの開催を中止することができるものとし、これによってユーザーに生じた損害について一切の責任を負いません。</p>

    <h2>第１０条（参加規約の変更）</h2>
    <p>
      当団体は、必要と判断した場合には、参加者に通知することなくいつでも本規約を変更することができるものとします。<br />
      なお、本規約の変更後、イベントの参加登録をした場合には、当該参加者は変更後の規約に同意したものとみなします。
    </p>

    <h2>第１１条（個人情報の取扱い）</h2>
    <p>当団体がイベントの参加によって取得する個人情報については、当団体「<a href="/privacy-policy">プライバシーポリシー</a>」に従い適切に取り扱うものとします。</p>

    <h2>第１２条（通知または連絡）</h2>
    <p>
      参加者と当団体との間の通知または連絡は、当団体の定める方法によって行うものとします。<br />
      当団体は、参加者からの当団体が別途定める方式に従った変更届け出がない限り、現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い、
      これらは、発信時に参加者へ到達したものとみなします。
    </p>

    <h2>第１３条（権利義務の譲渡の禁止）</h2>
    <p>参加者は、当団体の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡、または担保に供することはできません。</p>

    <h2>第１４条（準拠法・裁判管轄）</h2>
    <ol>
      <li>本規約の解釈にあたっては、日本法を準拠法とします。</li><br />
      <li>当団体に関して紛争が生じた場合には、主催者所在地を管轄する裁判所を専属的合意管轄とします。</li>
    </ol>

    <br />
    <div align="right">以上</div>

    <p>制定日：2020年4月1日</p>
    <Link to="/">トップページへ</Link>
  </Layout>
)

export default Terms